app/Http/Controllers/Auth/RegisteredUserController.php

select `id`, `name` from `countries`
---
    public function create()
    {
        $countries = Country::select('id', 'name')->get();