app/Traits/Followable.php

delete from `followings` where `followings`.`user_id` = 5 and `followings`.`following_id` in (4)
---
    public function unfollow($user)
    {
        // dd($user);
        return $this->followings()->detach($user->id);