app/Http/Controllers/MainPageController.php

    public function index()
    {
        $user = Auth::user()
            ->load('followings', 'followings.posts', 'followings.posts.images', 'followings.posts.latestComment', 'followings.posts.latestComment.user');
---
select * from `posts` where `posts`.`user_id` in (3)
select `users`.*, `followings`.`user_id` as `pivot_user_id`, `followings`.`following_id` as `pivot_following_id`, `followings`.`is_following` as `pivot_is_following`, `followings`.`created_at` as `pivot_created_at`, `followings`.`updated_at` as `pivot_updated_at` from `users` inner join `followings` on `users`.`id` = `followings`.`following_id` where `followings`.`user_id` in (7) order by `followings`.`id` desc