app/Http/Controllers/PostController.php

select * from `posts` where `posts`.`id` = '13' limit 1
select * from `users` where `users`.`id` in (4)
---
    public function postDetails($id)
    {
        $data['post'] = Post::with(['user', 'comments', 'images'])->findOrFail($id);

select * from `posts` where `posts`.`id` = '58' limit 1
---
    public function update(Request $request)
    {
        $request->validate([
            'id' => 'required|exists:posts,id',
            'caption' => 'required|string',
        ]);

        $post = Post::findOrFail($request->id);