app/Http/Controllers/ProfileController.php

select * from `posts` where `posts`.`user_id` in (2)
select `users`.*, `followings`.`user_id` as `pivot_user_id`, `followings`.`following_id` as `pivot_following_id`, `followings`.`is_following` as `pivot_is_following`, `followings`.`created_at` as `pivot_created_at`, `followings`.`updated_at` as `pivot_updated_at` from `users` inner join `followings` on `users`.`id` = `followings`.`following_id` where `followings`.`user_id` in (7) order by `followings`.`id` desc
select * from `users` order by `id` desc
select * from `posts` where `posts`.`user_id` = 1 and `posts`.`user_id` is not null order by `id` desc
---
    public function index()
    {
        // dd();
        $data = [
            'user' => Auth::user(),
            'posts' => Auth::user()->posts()->with(['images', 'comments'])->orderBy('id', 'desc')->get(),
            'followers' => DB::table('followings')->distinct()->select('user_id')->distinct()->where('following_id', '=', Auth::user()->id)->count()
        ];

select * from `posts` where `posts`.`user_id` in (4)
select * from `users` where `users`.`id` = '4' limit 1
---
    public function showUser($id)
    {
        $data['user'] = User::with(['posts', 'posts.images', 'posts.comments'])->findOrFail($id);

insert into `followings` (`created_at`, `following_id`, `updated_at`, `user_id`) values ('2021-08-11 16:11:54', '3', '2021-08-11 16:11:54', 1)
---
    public function follow(Request $request)
    {
        $request->validate([
            'follow' => "required|exists:users,id",
        ]);
        Auth::user()->followings()->attach($request->follow);

delete from `followings` where `followings`.`user_id` = 1 and `followings`.`following_id` in ('4')
---
    public function unfollow(Request $request)
    {
        // dd($request->all());
        $t = $request->validate([
            'unfollowed' => "required|exists:followings,following_id"
        ]);
        Auth::user()->followings()->detach($request->unfollowed);

select distinct `user_id` from `followings` where `following_id` = 1
select * from `users` where `id` in (4, 1, 5)
---
    public function followers(User $user)
    {
        // dd($data['followers']);
        $data['user'] = $user;
        $followersId = DB::table('followings')->distinct()->select('*')
            ->distinct()->where('following_id', '=', $user->id)
            ->pluck('user_id')->toArray();
        $data['authFollowings'] = Auth::user()->followings()->pluck('following_id')->toArray();
        $data['followers'] = User::whereIn('id', $followersId)->get();