app/Http/Controllers/admin/UserController.php

    public function toggleStatus(User $user)
    {
        $user->update([
            'status' => !$user->status
        ]);
---
update `users` set `status` = 0, `users`.`updated_at` = '2021-08-18 22:34:20' where `id` = 1