app/Http/Controllers/admin/UserController.php

    public function index()
    {
        $users = User::with(['role', 'country'])->get();
---
select * from `countries` where `countries`.`id` in (1, 2, 4)
select * from `roles` where `roles`.`id` in (1, 2)
select * from `users`